[
    {
        "Category": "Sports",
        "Article": "Maxwell takes a break to refresh after asking to be rested by RCB\nGlenn Maxwell has elected to take a break from the IPL to refresh himself physically and mentally after requesting Royal Challengers Bengaluru management pick someone else in his place for the match against Sunrisers Hyderabad.\nMaxwell has been struggling for runs in IPL 2024. Before Monday's game, he had scored only 32 runs in six innings at an average of 5.33. There were speculations that he might have sat out because of a thumb injury but that was not the case.\n\"For me, personally, it was a pretty easy decision,\" Maxwell said after RCB's sixth defeat in seven matches. \"I went to Faf [du Plessis] and the coaches after the last game and said I felt it was probably time we tried someone else. I have been in this situation in the past where you can keep playing and get yourself deeper into a hole. I think now is actually a good time for me to give myself a bit of a mental and physical break, get my body right. If I'm required to get in during the tournament, I can hopefully get back into a really solid mental and physical space where I can still have an impact.\n\"We have had a pretty big deficiency straight after the powerplay, which has been my area of strength over the last couple of seasons. I felt like I wasn't contributing in a positive way with the bat, and with the results and the position we find ourselves on the table, I think it's a good time to give someone else an opportunity to show their wares, and hopefully, someone can make that spot their own.\"\nComing into IPL 2024, Maxwell was in red-hot form. In 17 T20s since the start of November, he had 552 runs at an average of 42.46 and a strike rate of 185.85. During this period, he scored two hundreds as well.\nBut he started the IPL with a first-ball duck against Chennai Super Kings. Since then, he has had two more ducks and has lasted more than five balls only once - against Kolkata Knight Riders, when he made a 19-ball 28 with the help of two dropped catches.\n\"T20 cricket can be like that sometimes - it's a pretty fickle game,\" he said. \"Even if you look at the first game, I ran one off the middle of the bat to the keeper. I picked up the length really well, saw a scoring opportunity, but opened the face a little bit too much. When you are going well, that goes wide of the gloves, you get a boundary, you are 4 off 1, and you are away for the tournament.\n\"I probably just haven't got away - it's as simple as that. In the first few games, I feel I made reasonably good decisions, but I was still finding ways to get out. It can happen in T20 cricket and when it snowballs like that, you can go searching and try too hard and forget the basics of the game.\"\nThe SRH game, though, turned out to be a high-scoring one. Batting first, SRH posted 287 for 3, the second-highest total in T20 cricket. RCB replied with 262 for 7, making it 549 for the match, the most for a T20.\nplay\n2:12\nInside Glenn Maxwell's battle to find form at the IPLThe Australia allrounder talks about how he goes about training, going from a 'shocker' of net one day to one of his best the next\nMaxwell was asked if, in hindsight, he wished he had played one more game. \"I did notice during the powerplay that the pitch was not as slow and two-paced as it has been in the first few games,\" he said with a smile. \"And I realised it was probably a bad game to miss; it would have been nice to be out there batting.\n\"But as I said, I wanted to give myself not just the physical break but also the mental break to give myself the right to play professional cricket. I take a lot of pride in my performance, and I put in a lot of hard work behind the scenes to get my body right for every game. And it has been a pretty tough struggle, given my body is on the wrong side of 30. I think that physical and mental toll probably just wore me down a little bit.\"\nMaxwell had a similar IPL season in 2020 as well. Playing for Kings XI Punjab then, he managed only 108 runs in 11 innings, at an average of 15.42 and a strike rate of 101.88. He did not hit a single six that year.\n\"That was probably a different scenario,\" Maxwell said. \"Back then the thing that was hurting me was I was bowling really well. So I was actually playing more as a spinner who was used at the back end [with the bat]. We had KL [Rahul] and Mayank [Agarwal] who were the two leading run-scorers in the competition at that time, so there wasn't a lot of balls left in the game. So I wasn't able to get any match rhythm. And when I was, it was only for a few balls here and there.\n\"So I said the same thing to the Kings XI management back at the time, that we can have an overseas bowler in my place. But we didn't have an offspinner as well. So I sort of played as an overseas offspinner who could bat a little bit.\n\"The management here has been outstanding. We've been working together on taking a fair bit of ownership and the off-field leadership staff is trying to help out as much as they can. Unfortunately, runs just haven't come the way they should have when you are in really good form. I don't think I've had a better six months in cricket leading into this tournament. So it's frustrating when it ends up like this. But if I can get my body and my mind right, there's no reason I can't finish the tournament well if I do get another opportunity.\""
    },
    {
        "Category": "Sports",
        "Article": "Venkatesh Iyer, Manish Pandey pull off rescue operation for KKR\nplay\nManish Pandey walked out at 57 for 5 and scored a 32-ball 42 (2:02)\nThursday evening, Wankhede Stadium. The harsh afternoon heat was giving way to a pleasant evening when Kolkata Knight Riders' practice session got fully underway. Manish Pandey was among the first to take guard in the second of the two nets. Seeing him time some of the shots, one wondered why he had not played a match this IPL.\nPandey faced all types of bowling plus throwdowns at his disposal. Between the deliveries, he even had a banter with some of the bowlers, and by the end of his nearly 30-minute stint, he walked out of the nets all drenched in sweat.\nFriday evening, Wankhede Stadium. Left-arm seamer Chetan Sakariya marked his run-up on either end. A one-match suspension for fast bowler Harshit Rana had meant KKR had a slot in the XI for an Indian seamer. Even though Pandey was among five potential Impact Players for a sixth successive game, all indicators pointed towards Sakariya making his KKR debut.\nBut when Nuwan Thushara's triple strike had KKR reeling at 57 for 5 in the seventh over, they had to change their plan. So out walked Pandey as Impact Player, replacing an already dismissed Angkrish Raghuvanshi.\nKKR had never beaten MI at the Wankhede since 2012, so you wouldn't blame MI for thinking they had things in control, especially on a slightly two-paced surface. Venkatesh Iyer, who hit a century against MI at this venue last year, had started with two fours in his first four balls and was on 13 off 8 when Pandey joined him. But the next four overs produced just one boundary.\nIn the 11th over, Iyer flicked Piyush Chawla through fine leg for four and then smacked Gerald Coetzee for a four and a six to signal a move-on.\nPandey took the cue and capitalised on his favourable match-up against Jasprit Bumrah in the 14th over by taking 12 runs off him. It included a flicked four - replays indicated it went off Pandey's thigh pad and Bumrah wasn't happy about it the entire over - through fine leg and a ramped six over deep third to leave their head-to-head reading thus: 80 runs, 42 balls, no dismissals.\nPandey fell for 42 off 31 when he miscued one to cover but Iyer carried on. At the death, he pre-empted what the bowlers were attempting and hit crucial boundaries to bring up his second half-century of the season. He deposited Hardik Pandya over wide long-on before hitting a six and a four via reverse shot off Thushara in the 19th over.\nIn a bid to scoop Bumrah on the penultimate ball of the innings, Iyer lost his balance, and middle stump, and was the last batter dismissed for 70 off 52 balls. But despite KKR losing their last five wickets in 29 runs, his 83-run partnership with Pandey, off 62 balls, had steered them to 169.\nHeading into the game, KKR were the most expensive side in the powerplay this season, and had conceded the second-most sixes at the death. Given Mitchell Starc's poor form, MI's long batting line-up, and the dew, a target of 170 did not look challenging.\nBut Varun Chakravarthy and Sunil Narine derailed their chase, with identical figures of 2 for 22 off four overs. Starc, who came into the match with seven wickets from eight games at an economy of 11.78, also picked up 4 for 33, including three in the 19th over to seal KKR's seventh win in ten outings.\n\"Venky's been fantastic for us,\" Starc said at the post-match press conference. \"He has certainly not been out of touch, he has been hitting the ball nicely through the games and certainly at training. Tonight was the night he got the runs to reward that hard work. Not our best start with the bat but the way he went about his innings to absorb some pressure, still keep the scoring rate pretty healthy and build a fantastic innings for us alongside Manish Pandey, that was a really key partnership.\n\"They showed their experience. Obviously, Venky has got good memories here from last year, scoring a hundred. That partnership tonight was what got us to a total we thought we could defend. He used all parts of the ground pretty well, he fought his way through the innings.\""
    },
    {
        "Category": "Sports",
        "Article": "Rohit played as Impact Player because of 'mild back stiffness'\nRohit Sharma looked good after walking out as the impact sub AFP/Getty Images\nA \"mild back stiffness\" forced Rohit Sharma to play as Impact Player in Mumbai Indians' match against Kolkata Knight Riders on Friday.\n\"He just had a mild back stiffness so it was just a precautionary thing,\" Piyush Chawla said at the post-match press conference.\nRohit made 11 off 12 balls as MI failed to chase down a target of 170 on a two-paced Wankhede pitch. It was their eighth defeat in 11 games, leaving them languishing in ninth position and their playoffs chances hanging by a thread. Upon being asked what's left for MI to play for, Chawla was candid.\n\"For the pride and the reputation,\" he said, \"because sometimes when you enter on the field, you don't think whether you are going to qualify or you are not going to qualify. You have to play for your name and that's what we are playing for.\"\nFor Chawla, the silver lining during the match was becoming the second-highest wicket-taker in the IPL, going went past Dwayne Bravo's tally of 183.\nChawla got there by having Rinku Singh caught and bowled with his first ball of the match. Reflecting on his record, Chawla said: \"It has been a beautiful journey because IPL started 17 years back and at that time nobody gave that much preference to the spinners, but now if you see that in top few wicket-takers from India are all the spinners, [R] Ashwin, Yuzi [Yuzvendra Chahal], myself, so it's a good feeling.\""
    },
    {
        "Category": "Sports",
        "Article": "Starc: Impact Player rule has played a part in bowlers' inflated numbers\nplay\nMitchell Starc's four-wicket haul helped KKR bowl MI out for 145 (1:18)\nIPL 2024 has been a mixed bag for Mitchell Starc. He was the most expensive pick ever at an IPL auction - going for INR 24.75 crore - but was also having a tough time with the ball. In an edition that is seeing an unprecedented high-scoring rate, Starc had just seven wickets and an economy of 11.78 in his first eight outings, and had conceded more than 50 three times.\nOn Friday, he bounced back with 4 for 33 in Kolkata Knight Riders' 24-run win over Mumbai Indians, and said the Impact Player rule had a part to play in the bowlers' inflated numbers this season.\n\"The Impact Player rule changes things a fair bit,\" Starc said at the press conference. \"Everyone gets to bat a lot deeper having a batting and a bowling XI. There's a lot made of that rule throughout the tournament and there's been a lot of high scores, which is the nature of the wickets and the grounds we play on here. When you have batters and batting allrounders come in at Nos. 8 or 9, it's a long batting line-up.\n\"There's no fear in the powerplay when all you have to do is to clear the infield and score runs. Certainly, there has been some really good batting, don't get me wrong, it's not just the rules that play a part there. There's been some fantastic scoring, some fantastic partnerships and some individual brilliance with the bat.\"\nStarc began his spell against MI with a full ball that thudded into Ishan Kishan's front pad but was sliding down the leg side. Kishan then hit him for a four and a six but Starc exacted revenge by flattening his leg stump. He then came back at the death and picked up three wickets in the final over to finish with his best figures of the season.\n\"I haven't changed too much,\" he said. \"It's about assessing conditions after the first innings. We certainly spoke about it and the batters that came off throughout that first innings mentioned the wicket and the lengths that were the hardest to face. That created the bowling plans for us.\nplay\n3:02\nStarc explains the effects of the Impact Player rule on the IPLHe also talks about the difference its absence will make in the upcoming T20 World Cup\n\"As T20 cricket doesn't always go the way you want it to go, and of course I wanted to go a bit better at the start. But I am not the only bowler going for runs. It is what it is. The fact that we sit second [on the points table] and are building towards the more important games at the back end and are playing some good cricket, hopefully I can be a part of it too.\"\nThere is just one week's gap between the IPL and the T20 World Cup in the West Indies and the USA. But Starc is not worried about his workload.\n\"It's T20 cricket, it's not as demanding as Test match cricket,\" he said. \"Physically it is not a problem and it's fantastic lead-in to play here in the best T20 league in the world. You're playing some high-quality cricket leading into the World Cup, a lot of players at this tournament are going to be at the World Cup.\n\"In that regard, it's a great thing to see and test your skills. In terms of length of time, that's part and parcel of international cricket. My main focus is to play in Lucknow in two days' time. The World Cup is next month - at this moment, it's [about] trying to help KKR win the tournament.\"\nStarc expects the T20 World Cup to provide a more even contest between bat and ball, unlike the IPL where totals of over 200 have been commonplace.\nplay\n10:20\nWill the T20 World Cup be as high-scoring as the IPL?Aaron Finch, Mitchell McClenaghan and Varun Aaron discuss what to expect at the T20 World Cup after an extremely high-scoring IPL season\n\"There's no Impact Player rule [in international cricket], so whether that affects the scores is yet to be seen. I think it probably will. People talk about the balance of the team when you can't just bring someone in. Your allrounders come back into play. Captains have to think a bit tactically, too, when you have just 11 players. It's been interesting to experience it first-hand in the IPL.\"\nStarc also lauded the \"exciting, young group\" of fast bowlers at KKR. Harshit Rana played all games before his one-match suspension and has taken 11 wickets at an economy of 9.78. Vaibhav Arora has picked up nine wickets in six outings at 9.42.\n\"I am a bit more experienced and a bit older, at the same time I haven't played a lot of T20 cricket,\" Starc said of his interactions with them. \"[So it is about] working off each other in a way.\n\"I am certainly not there to tell people what to do, I am happy to answer questions if they have [any] or look to lead more by example at training and get my work in. We are a pretty good group, the whole group of players and staff is awesome to be around.\n\"I would like to think I am approachable, so happy to train with the boys. I was training with Harshit Rana the other night, made him run extra which he wasn't happy about (laughs). But no, it's a great group and a lot of time we have a lot of fun.\""
    },
    {
        "Category": "Sports",
        "Article": "Impact sub Pandey finally gets his chance, and makes it count\nplay\nManish Pandey walked out at 57 for 5 and scored a 32-ball 42 (2:02)\nManish Pandey had been waiting for an opportunity to have a say for Kolkata Knight Riders (KKR) in IPL 2024 and finally got his chance on Friday.\nA top-order collapse after KKR had been asked to bat meant he went out as an impact player and scored a 31-ball 42 - it might not mean much in an IPL as high-scoring as this one, but played a huge role on the night, as KKR beat Mumbai Indians (MI) by 24 runs at the Wankhede.\nPandey walked out at No. 7 with KKR tottering at 57 for 5 and his 83-run stand with Venkatesh Iyer, who top-scored with a 52-ball 70, took KKR to 169 before they bowled MI out for 145.\n\"Certainly this impact-player rule it has specifically helped us in this game, and Manish, he's been eyeing for an opportunity right from game one but today he got one and he capitalised on it,\" KKR captain Shreyas Iyer said on the official broadcast after the game.\n\"It was fantastic to see him go out there and basically build on the partnership with Venky, who has been phenomenal on this wicket and, yeah, we got to a commendable total. All I had to say to the boys [was] that if we have got here, we can defend it with our bowling lineup and that's what we did.\"\nVenkatesh, the Player of the Match, said that it was important for him and Pandey to rebuild, even if the scoring rate wasn't much, to save the likes of Andre Russell for the death.\n\"This is the fourth or fifth time where Manish has padded up, but this time he eventually got to bat,\" Venkatesh said. \"Yeah, that's the plan obviously. With the impact-player rule, if you see a collapse, you can get a batter in, and he can add to the score.\"\nAsked if giving up the impact-player option within the first quarter of the game was wise, Venkatesh said, \"It was very important at that time. With Russell and Ramandeep [Singh] coming in a situation where they don't play, it was better for someone like Manish to come in and accelerate. And he did well as well.\n\"Initially, I told him it will take time to adjust to the wicket. The ball was holding up, and it was a two-paced wicket. So I told him we have the cushion of time and he is an experienced candidate. He was the one guiding me throughout the innings, how to face the bowler, which bowler to attack, [in] which situation to be aggressive - that communication was very good.\"\nIt was Venkatesh's second half-century of IPL 2024, and his best score by far, leaving behind the 30-ball 50 he scored in KKR's win over Royal Challengers Bengaluru (RCB) early in the tournament.\n\"I try to be a smarter cricketer,\" Venkatesh said about his approach to the innings. \"Everyone has the skillset but if you are smart, you can make those decisions.\n\"It would be very easy for me to go after someone like Piyush Chawla or maybe fast bowlers, just hit them because Wankhede is known as a six-hitting ground. But the team needed me to be there till the end and I'm really happy for that.\""
    },
    {
        "Category": "Sports",
        "Article": "Bayern's season a failure without Champions League title - Kane\nHarry Kane has said he is still motivated by proving his critics wrong but admitted Bayern Munich's season will be a failure if they cannot win the Champions League.\nBayern host Arsenal in Wednesday's quarterfinal, second leg at the Allianz Arena with the tie evenly poised at 2-2 from last week's first game.\n- Stream on ESPN+: LaLiga, Bundesliga, more (U.S.)\nKane began his youth career at Arsenal but was released by the club aged nine and has previously spoken about the impact it had on his career, saying it instilled a determination to push himself that contributed to a record of 15 goals in 20 games against the north London club.\nThe 30-year-old became the all-time record goalscorer in north London derbies before leaving Tottenham for Bayern last summer in a deal worth up to €120 million ($128m).\nWhen asked at a news conference on Tuesday if he still felt the same determination to prove Arsenal wrong, Kane said: \"I think it was one of the biggest games of the season for pretty much my whole career, we played them at least twice a year for the last 10 years and it was always a big occasion, big moment.\n\"Maybe it was in the back of the mind, being released from a young age, and there's always a point to prove -- I'm the type of player who, throughout my career, has had points to prove along the way. I don't think that ever leaves you. I think it'll always be in my DNA until I retire.\n\"There'll always be a reason to prove someone wrong or to prove to myself I can do something, so I don't think specifically back to that and think 'I was released when I was 9 years old, I really have to make a difference tomorrow.'\n\"Now I'm here at Bayern Munich it's just about being a top team in the Champions League. Of course I have history with them [Arsenal], but all I can do is try and help Bayern Munich qualify for the semifinal of the Champions League.\"\nBayern missed out on the Bundesliga title for the first time in 12 years as Bayer Leverkusen lifted the trophy last weekend and Kane said: \"Of course, from the club's point of view it will be a failed season if we don't win anything this year because we're expected to win, but then all you can do it take that into next year and try to turn that around.\n\"So I think that's a harsh reality in winning and losing, you can do a lot of good things throughout the year and still end up on the losing side so I don't think it's as harsh as that, there's a lot of things that go into it but I think the main thing for us right now is that we still have an opportunity to turn the season into a great season if we win the Champions League.\"\nBayern boss Thomas Tuchel believes his team's greater pedigree in the competition gives them the edge ahead of Wednesday's second leg.\nArsenal are playing in the Champions League for the first time in seven years and have not reached the semifinals since 2009.\nSix-time winners Bayern last won the competition in 2020 but they have lost at the quarterfinal stage in each of the past three seasons.\n\"I think we have the slight advantage of experience in our team,\" said Tuchel, who lifted the trophy a year later with Chelsea, defeating Manchester City in the final.\n\"We have players who have won it, we have players who have played decisive matches in this competition. But to make in an advantage, we still have to bring out our very best.\n\"It can also sometimes be an advantage not to have the experience and have the role as contenders, the role as a hunter. That can be something for Arsenal. To go for it after so many years.\n\"Also for us it's not so usual for us to be in a semifinal. If you see the last years it's not so easy for us, or anyone, to overcome this stage. Now the situation is here that we have one decisive match to make the next big step in this beautiful competition.\n\"We are determined to bring everything to the table. If the experience within our group brings us an extra 5% we are happy to bring it to the table.\n\"But we have to bring it. Nobody will give us anything. It's like this in this competition. It's super tough.\""
    },
    {
        "Category": "Sports",
        "Article": "ISL Final: Mohun Bagan favourites at home, Mumbai City bank on mentality and belief\nFILE: Lallianzuala Chhangte of Mumbai City FC and Liston Colaco of Mohun Bagan Super Giant. Hariom Hans/Focus Sports/ISL\nThe Big Picture\nJust three weeks ago, Mumbai City FC came to Kolkata with a chance of winning the ISL League Shield, they needed just a draw to do it. In the end, they went down 2-1 and lost the Shield to Mohun Bagan Super Giant. They are coming back to the Salt Lake Stadium, looking to win their second ISL Cup having earlier won it back in 2021, when Bipin Singh's last-gasp winner helped them beat ATK Mohun Bagan in the final.\nFor Mohun Bagan, this is their chance to become the first team to win back-to-back ISL Cups. Their recent form, especially at home, means they start the final as overwhelming favourites. They are chasing a treble in a season that is turning into an incredible one for the club.\nMumbai have lost twice to Mohun Bagan at the Salt Lake earlier this season -- in the Durand Cup quarterfinals and the League Shield decider. Both coach Petr Kratky and captain Rahul Bheke said that they have learnt their lessons from those games -- their slow start in both the matches being a specific area they've focused on.\nThey went down to an early Liston Colaco goal in that Shield-deciding match, and chasing the game against this Bagan side isn't a position that any side would like to find itself in. For Bagan, they conceded a late 89th minute goal from Lallianzuala Chhangte in the same match, so they know that Mumbai are a side who go on until the final whistle. But Antonio Lopez Habas' side are no less. Sahal Abdul Samad's winner in the semifinal came in the 93rd minute, while Dimitri Petratos, especially in these big games, has proved himself to be a consistent scorer of decisive late goals.\nIn a game that will be decided by small margins, having players who can produce moments of brilliance is a huge weapon for either side to have.\nForm Guide\nMohun Bagan Super Giant - W L W W W\nThe only loss in their last five games came against Odisha FC in the first leg of the semifinal, where they were stung by a Roy Krishna brace. However, Bagan are a side brimming with confidence, especially having won two of their three games against Mumbai City this season. The recent form of Manvir Singh and Liston Colaco in front of goal is also a huge boost for Bagan.\nMumbai City FC - W W L W W\nMumbai were starting at two defeats in a row heading into second-half of the stoppage time in the first leg of their semifinal against FC Goa, but that turnaround in the last six minutes turned their belief around as well. Kratky stressed on how those six minutes have really helped him to bring back the belief after the League Shield loss to Bagan.\nConcerns for either side\nMohun Bagan Super Giant: how to deal with the Mumbai City wingers?\nIn Habas's system, Manvir and Liston have found their positions as ultra-attacking wing-backs, but Kratky recognised that their attacking threat would come at the cost of leaving space in behind which their wingers could exploit.\nChhangte and Vikram Partap Singh will run in behind into those spaces, and Mumbai are likely to have Alberto Noguera picking those passes, so Bagan will have to have a plan to counter those runs. That plan is likely to involve Deepak Tangri in the middle of the park breaking down the play and making sure the passes to the forward players aren't found. However, particularly on their left side, Bagan have arguably India's best one-on-one defender in Subhasish Bose, with their captain giving them their best option to stop Chhangte.\nMumbai City FC: Yoell van Nieff leaves a hole in the middle\nDutch midfielder Yoell van Nieff will miss the final due to a suspension, and Mohun Bagan are the last opponent that you'd want to miss your main defensive midfielder against. Petratos and Anirudh Thapa playing as two number 10s behind Jason Cummings would mean that Mumbai City would have to close that space down as effectively as they can. Kratky, though, preferred to see it as an opportunity for someone else to come in and play a role for the team.\n\"He's a good player, we'll miss him, but we have good players who can step up and do the job for us on the pitch,\" the coach said.\nIn addition to his duties as a defensive midfielder, van Nieff is also their most important set-piece taker, and given Mumbai City's aerial threat, that is a massive concern as well.\nPredicted XIs\nATK Mohun Bagan (3-2-4-1): Vishal Kaith; Anwar Ali, Hector Yuste, Subhasish Bose; Joni Kauko, Deepak Tangri; Manvir Singh, Anirudh Thapa, Dimi Petratos, Liston Colaco; Jason Cummings.\nMumbai City FC (4-2-3-1): Phurba Lachenpa; Valpuia, Rahul Bheke, Tiri, Mehtab Singh; Thaer Krouma, Apuia; Lallianzuala Chhangte, Jayesh Rane, Vikram Partap Singh; Jorge Pereyra Diaz.\nWhat they said:\n\"We have to respect Mohun Bagan's quality, but we know our quality as well. The last time, we didn't start well and that cost us. So now, we'll have to play our football right from the first minute.\" - Petr Kratky, Mumbai City head coach.\n\"We've played them three times this season, so we know their attackers and they know us too. Our only aim is to try and keep the clean sheet tomorrow.\" - Rahul Bheke, Mumbai City captain.\n\"When I came in, the first thing I told the players was that we could win the shield and the cup if we showed the ambition and desire to win.\" - Antonio Lopez Habas, Mohun Bagan Super Giant head coach.\n\"It's not just 11 players on the ground, we'll take the support of the lakhs of Mariners with us on to the field in the final.\" - Subhasish Bose, Mohun Bagan Super Giant captain.\nVenue: Vivekananda Yuba Bharati Krirangan also known as Salt Lake Stadium, Kolkata.\nKickoff: 7:30pm IST."
    },
    {
        "Category": "Sports",
        "Article": "The other Mumbai Indians: City boss Kratky aims to win ISL with domestic core\nAbhijit Addya/ Focus Sports / ISL\nThe magnitude of the task that faces Mumbai City FC in the 2023-24 ISL final cannot be overstated. While Antonio Lopez Habas refrained from calling his Mohun Bagan Super Giant side the favourites for the final, the numbers and the circumstances certainly do stack up in their favour. If Mumbai City are to win the trophy on Saturday, they will have to pull off one of the most famous wins in Indian football.\nThere's one little piece of history that they can take heart from, though - The home team have lost all three ISL finals that haven't been played at a neutral venue in the nine previous seasons. The odds may be against them, but it won't be the first time they would be fighting adversity this season.\nThey lost their head coach midway through the season as Des Buckingham went back home, they lost arguably the most gifted footballer the ISL has seen in recent years in Greg Stewart, they parted ways with their rock at the back in Roystyn Griffiths.\nPetr Kratky came in from the City Football Group stables and has taken over as if he's been in charge of this team for years, but in just five months in charge, he has also put his own stamp on the team.\n\"Mumbai Indians\"\nPerhaps for the first time in the history of the ISL, a club has managed to reduce its foreigners to being the support cast for the Indians. The last few seasons may have seen the number of foreigners allowed on the field reduced to four, but they were still playing all the important positions through the spines of the sides.\nWithout underplaying the importance and performances of the likes of Jorge Pereyra Diaz and Yoell van Nieff to Kratky's team, this clearly is a side that is being propelled by its Indian talent.\nThe numbers paint a glowing picture for Kratky the coach. 23 of 33 league goals that Mumbai City have scored under him have been by Indians. 20 of those goals have been assisted by Indians. Their top three goalscorers under Kratky have been Indians. Their top four assist-providers under Kratky have been Indians.\nWhat has he been feeding them, then?\n\"I think it's confidence,\" Jayesh Rane said, \"that helps a lot, the words he says really helps not just me, but everyone in this team.\"\n����������������������. ����������. #������������������������. ��\nHere's how #TheIslanders overcame the challenge at the Fatorda in the first leg of our semi-final last night ��\nWatch #ISL10 on JioCinema, Sports18 & VH1 �� #AamchiCity �� pic.twitter.com/bcC8hYFnbL\n- Mumbai City FC (@MumbaiCityFC) April 25, 2024\nDespite not being a regular starter for his side, Rane has four assists this season, all of them coming under Kratky, the joint-most in that time period alongside Lallianzuala Chhangte.\nRane's importance in the final could be even more than it has been so far, with Yoell van Nieff out with a suspension. He could come into midfield alongside Apuia and either of Alberto Noguera or Thaer Krouma, should Kratky choose to go that way. Up against Joni Kauko and co., he will face a stiff test, but it is one that he is primed to take on.\nChhangte himself has scored 9 times in 18 games under Kratky, with Vikram Partap Singh followed close behind with 8 goals of his own. The youngster's emergence has seen him earn a starting spot in Igor Stimac's national team as well.\nFor Kratky, it is simple. His idea when he came to Mumbai City was to cut out the dependency on just one or two players for the goals. In the six league games before he arrived at the club this season, Mumbai City scored 13 goals and Pereyra Diaz scored six of them.\n\"For me as a coach, I want to see the players performing and growing. If it's the local players, it's fantastic. I just hope they keep performing and proving they are good footballers, because they are,\" he said.\nThe importance of the leader Rahul Bheke\nMumbai City's most experienced Indian player has certainly stepped up in crunch time this season. Particularly in the second leg of the semifinal, Bheke completely shut down the threat of Noah Sadaoui to ensure that FC Goa's attacking threat was minimized, as Mumbai City protected a one-goal lead at home in style. Bheke even assisted Pereya Diaz's goal that broke the deadlock on the night.\n\"He's been amazing support from within. Very happy and blessed to have him in the team, he helps a lot. Especially in the last game, he stepped up, it's always a privilege to have this type of player in the team,\" Kratky said.\nWith the changes within the team midway through the season, it was doubly important for Mumbai City to have a leader who ensured the players were focused on the task at hand, as they were also playing the AFC Champions League at the time.\n\"We were shocked when Des left,\" Bheke said. \"When coach [Kratky] came into the team, we welcomed him really well, and the team continued to play the same brand of football, I think that was very important.\"\nHead Coach Petr Kratky, Skipper Rahul Bheke, Alberto Noguera and Jayesh Rane speak up ahead of #TheIslanders' big Final in Kolkata tomorrow! ��\nFull press conference: https://t.co/dNLmFb6Zfz #MBSGMCFC #ISL10 #AamchiCity �� @PetrKratky @RahulBheke @NogueraAlberto @jayeshrane11 pic.twitter.com/lb1rRwTZw4\n- Mumbai City FC (@MumbaiCityFC) May 3, 2024\nHowever, even if the brand of football remained the same, there are always some specific adjustments that each coach makes. Without having a pre-season at hand, it was important for Kratky to get his message through to every player in the squad. Bheke was his man for that.\n\"Especially the younger players in the squad, they need to know exactly what the coach's ideas are, what he expects of them, I just ensured that all of them understood what was needed from them,\" the Mumbai City skipper said.\nThe precociously talented bunch of players that Bheke will lead out on to the Salt Lake turf on Saturday night know that a famous night awaits them. If they pull off this win, it will be remembered for a long time. Perhaps even if they don't, this season they produced deserves to be remembered for a long time.\nLike Kratky said, they have done things \"the Mumbai City way\"."
    },
    {
        "Category": "Sports",
        "Article": "The Habas revival: How Mohun Bagan's coach made them super, ISL giants again\nAntonio Habas has led Mohun Bagan to the 2023-24 Indian Super League final, aiming for their third trophy this season. Abhijit Addya/Focus Sports/ISL\nSalt Lake Stadium. Mohun Bagan. Final.\nThey've been here before this season. Against East Bengal, no less. A third trophy awaits them on Saturday night at home, and it's safe to say the task facing Mumbai City FC couldn't be any stiffer.\nRewind to the end of December, however, and things didn't seem as rosy for Bagan. They'd just lost three Indian Super League (ISL) games in a row, and were heading into the AFC Asian Cup break in somewhat of a crisis. That run of results cost Juan Ferrando his job. So, in came Antonio Lopez Habas - that serial winner of ISL silverware. How does he keep doing it?\n\"Habas was very clear with his ideas. He made everyone believe that we have a good squad, all we needed to do was to commit ourselves into the game, I think that's how the aggression came and we started to win games,\" midfielder Anirudh Thapa said.\nThapa had sympathy for Ferrando, saying the injuries to several players in December was a major cause of that dip in form. They had a run of tough games as well - their three straight losses came against Mumbai City, FC Goa and Kerala Blasters, all of whom finished in the top six this season.\nThe change in system\nHabas, though, stuck to Ferrando's 4-2-3-1 system in one game. They drew the Kolkata derby 2-2. He'd seen enough - Bagan needed a drastic change. East Bengal created more chances than Bagan who huffed and puffed until Petratos's late equalizer brought them a point.\nThe 4-2-3-1 was gone. The 3-2-4-1 was in. He chose to put attacking players out wide, eventually settling on Manvir Singh and Liston Colaco to play on the flanks. Alongside Petratos and one of Armando Sadiku or Jason Cummings, they just had more bodies providing attacking threat.\nBut perhaps Habas' most significant move came in moving Thapa out of the defensive midfield role. All his career, he'd been operating in a more advanced role, either as a no.8 or a no.10. Thapa was being shackled by Ferrando - and was let loose by Habas.\n\"I felt I was doing what my coach asked me to do as a no.6, and the same now as a no.10, but this is what I've done throughout my career and I enjoy it,\" he said.\nSo while Thapa was doing a job for Ferrando as well, he clearly wasn't enjoying playing in a position that was not allowing him to show off the array of qualities that made him one of India's most sought-after midfielders in the last few years.\n\"Definitely not [number] 6,\" he said when asked of his favourite position, \"8 or 10, I feel I can do both, but I'll choose 10 because it allows me to get into the box.\"\nWhat allowed Thapa to play in a more advanced role was the replacement of Hugo Boumous from the ISL squad with Joni Kauko, who had just recovered from a long-term injury.\n\"The coach brought in Joni, he's a beast on the field,\" said Dimitri Petratos, who has been immune to the managerial change and continues to be the heart and soul of this Bagan side.\nWith 22 goals and 14 assists in the ISL since his move to Bagan at the start of the 2022-23 season, Petratos has made a solid case to be called the best player in the league.\n\"If we have more players who can score and assist like Dimi does, I think we can be unstoppable,\" Thapa said.\nThe new system has only made Petratos an even bigger threat. Considering how good he was under Ferrando, it might have been seen as impossible to make him an even bigger threat. Habas has managed to do that. Even while playing as a lone no.9, he loved to drop deep, get on the ball and make a difference. Now he's got way more runners in front of him to pick out a pass for, while still remaining as dangerous a goal threat as he's always been.\nMaking the Salt Lake a Fortress\nBagan have lost once in seven league games at home under Habas - a shock 3-2 reverse against Chennaiyin FC when they conceded in injury time. However, with the general uptick in results and the kind of football they are playing now, Habas has made opponents fear going to the Salt Lake.\nMumbai City needed only a point to win the league shield on the final day, they wilted under the noise. Odisha FC came into the semifinal second leg with a lead, it seemed like those clad in maroon and green in the stands gave the players the energy to just keep running until Sahal Abdul Samad's 93rd-minute winner.\nThe crowd is a massive factor, say both Petratos and Thapa. Kolkata can be known to be demanding, they accept nothing less than winning trophies.\nAs the captain says ��♥️\nWatch #ISL 2023-24 live on @JioCinema @sports18 & @vh1india\n�� https://t.co/s6ihnnu494#MBSG #JoyMohunBagan #আমরাসবুজমেরুন #ISL10 #LetsFootball #ISLonJioCinema pic.twitter.com/IOM1sEDXv1\n- Mohun Bagan Super Giant (@mohunbagansg) April 30, 2024\n\"I was expecting for example the fans to be a certain way, but it has been way more. I get so much energy from them, and it's not just me, but all the players, so we're all looking forward to the next game,\" said Petratos.\nThis may also be attributed to a set of players who have gone that extra mile in making themselves loved by their fanbase. A few years of turmoil under changed ownership and confusion over whose (and what) club it really was meant that Bagan's was a fanbase that needed to be cajoled a bit back into the fold. Gestures like Petratos going to the maidans of Kolkata for a kickabout with a group of kids have only endeared him even more to this half of the city.\n\"It's natural to me, I love playing football, anywhere and with anyone. It's those kids on the grounds that will eventually come to the big stadium, these are our people we need to be with always\" he said.\nTheir people will be with them on Saturday night. As they always do on these big occasions, they will demand nothing less than the trophy. Mohun Bagan Super Giant are going for a fourth domestic trophy in the space of a year. No side in Indian football has been better placed to do it than this well-drilled Habas machine."
    },
    {
        "Category": "Sports",
        "Article": "Phil Foden primed to join Man City's greatest - Guardiola\nplay\nJulien Laurens believes Man City will struggle to play both Phil Foden and Kevin De Bruyne in centre midfield. (1:55)\nPep Guardiola has backed Phil Foden to become one of Manchester City's greatest-ever players after the England midfielder was named the Football Writers' Association (FWA) Men's Footballer of the Year.\nFoden won the award after the best individual season of his career during which he has scored 24 goals, including 16 in the Premier League.\n- Stream on ESPN+: LaLiga, Bundesliga, more (U.S.)\nStill only 23 and having already won 14 major trophies, Guardiola says the forward will join the likes of Colin Bell, Mike Summerbee, David Silva and Sergio Agüero as one of the best players in the club's history.\n\"This club has a long, long history so you can't forget what happened with the players who played at Maine Road, like everyone knows,\" Guardiola told a news conference on Friday.\n\"I think the club has been built with many, many top quality players. I have the feeling if he continues his career until the end here and continues that level he can be one of the best, that's for sure.\n\"Why don't we wait until he retires and after we can see, he's still young.\"\nFoden is set to return to the City squad for Saturday's Premier League clash with Wolves at the Etihad Stadium after missing the 2-0 win over Nottingham Forest because of illness.\nGuardiola is also hopeful that Éderson, who went off injury at the City Ground, and Erling Haaland will both be fit to start.\nCity could kick off against Wolves four points behind Arsenal at the top of the Premier League if Mikel Arteta's team beat Bournemouth at the Emirates earlier in the day.\nGuardiola, however, insists his team do not need to win the title or the FA Cup for him to believe it's been a successful campaign.\n\"It's not about winning or losing that will change my opinion about this season in terms of what they have done,\" he said.\n\"If we win these two prizes it's not going to change at all my opinion about that, about the club if we win or don't win the title.\n\"Of course we want it but we are fighting for something no team in this country has done ever -- ever -- so of course it's a big challenge and we want it.\n\"But my opinion? It depends if we win in the last minute or not? No chance. I love them so much.\""
    },
    {
        "Category": "Sports",
        "Article": "Swiss Open 2024: Lakshya leads Indian contingent chasing Olympic qualification spots\nLakshya Sen in action during the 2023 BWF World Championships in Copenhagen, Denmark. Shi Tang/Getty Images\nThe BWF Swiss Open kicks off the final 40 days of the qualification window that the Badminton World Federation [BWF] have set out for the Paris Olympics, and battles for a ticket to the big one are gaining pace now. The window, which started on May 1, 2023 will close on April 28, 2024.\nBefore we proceed, though, a reminder of how many athletes will go to Paris -- 35 athletes each in the two singles events. If two athletes from the same country have to qualify, they both must be in the top 16 of the BWF Race to Paris (RTP) rankings by the end of April.\nMeanwhile, the list is shorter for doubles, with 16 teams each going to Paris across the three doubles disciplines. Only two teams per country are allowed, and that is only if the two teams are ranked in the top 8 of the RTP.\nWe look at India's prospects discipline-wise, and with a sharper context of the upcoming BWF Swiss Open 2024 in mind:\nMen's Singles\nHS Prannoy's ticket to Paris is already booked, so his decision to take time off and focus on physical recovery makes sense. It's the second spot, though, where it gets tricky.\nLakshya Sen is in the top 16, just. Ranked RTP #15 after two stunning runs to the semifinals in the French Open and All England Championship, he needs to keep his new-found momentum to stay within the qualification zone. The next closest Indian is Kidambi Srikanth, who's RTP #26. He needs to go on a strong run, starting at the Swiss Open, to seriously challenge for a spot.\nIn Basel, Lakshya will start against Leon Jun Hao of Malaysia before a potential second-round match against the in-form Frenchman Christo Popov. Win that, and he could be in for a potential quarter against top-seed Lee Zii Jia (or Srikanth). Srikanth starts against Wang Tzu Wei before a likely second-round clash against LZJ.\nThere's more Indian interest, though, with Priyanshu Rajawat (RTP #32) taking on fourth seed Lee Cheuk Yiu of Hong Kong and Kiran George (RTP #35) taking on Takuma Obayashi of Japan in the opening round.\nWomen's Singles\nPV Sindhu is currently RTP #13 and with the next Indian ranked #40 (Aakarshi Kashyap), she should have a straightforward march to Paris. But after having shown glimpses of returning to her old self in Paris and Birmingham over the past fortnight, she'll want a deep run in Basel to keep that mojo going.\nSeeded fourth, she starts off with a clash against Yvonne Li (who retired hurt against Sindhu last week at All England). A win there and Japan's Tomoko Miyazaki awaits... but a tougher test would be in the quarters where she takes on Paris-chasing Aya Ohori (RTP #11, second-highest Japanese player, seven places below Akane Yamaguchi and just six above Nozomi Okuhara) or Paris-chasing Busanan Ongbamrungphan (RTP #20, one place below Pornapawee Chochuwong and six below Ratchanok Intanon)\nAakarshi, meanwhile, starts with a tough draw against Michelle Li. Win that and one of Okuhara or Intanon await her in the second round.\nMen's Doubles\nWorld no. 1 Satwiksairaj Rankireddy and Chirag Shetty are RTP #2 and have their Paris berths sealed. They, like HSP, are skipping this tournament to focus on recovery. With that, there will be no Indian presence in MD at Basel.\nPath to Paris: After historic 2023, 'hungry' Sat-Chi embrace pressure, master the mind games\nWomen's Doubles\nThis here is a two-way battle between Tanisha Crasto-Ashwini Ponnappa (RTP #20) and Treesa Jolly-Gayatri Gopichand (RTP #26) to see who'll go. With only a max of two teams per country allowed, it is almost a certainty that whoever of Ash-Tan and Gaya-Tree finish the RTP higher will go to Paris. (For instance, China have five teams in the top 20, Japan have another five, South Korea have three).\nAsh-Tan begin their campaign against Rose-Puspitasari of Indonesia before a potential second-round match against Japan's Hirokami-Kato (RTP #30). On paper, the draw gives them a relatively straightforward run to the semis where they're likely to face top seeds (RTP #9) Rahayu-Ramadhanti of Indonesia.\nIncidentally, the top seeds get going against another Indian pair, the Panda sisters Rutuparna and Swetaparna (#48 in RTP).\nGaya-Tree are on the other side of the draw and start against Annie and Kerry Xu of the USA, before a possible second-round meeting with compatriots Priya Konjengbam and Shruti Mishra (RTP #75). Their side of the draw is stacked with Paris-chasing Kusuma-Pratiwi (RTP #18, second-highest ranked Indonesian pair) a potential quarterfinal opponent and Denmark's Fruergaard-Thygsen (RTP #22) or Nakanishi-Iwanaga (RTP #12, fourth highest ranked Japanese team) potential semifinal opponents.\nWomen's doubles is the most heavily represented event for Indians in Basel, with Ashwini Bhat - Shikha Gautam (RTP #59) making it five Indian pairs. Bhat-Gautam have a tough opener, taking on RTP #17 Yeung-Yeung of Hong Kong.\nMixed Doubles\nThere's no Indian participation at the Swiss Open, and there's next to no chance there will be Indian participation at the Olympics in this event - the highest ranked Indians are Satish Karunakaran and Aadya Variyath, and they're #44 in the RTP."
    },
    {
        "Category": "Sports",
        "Article": "2024 All England Championships takeaways: Lakshya's resurgence, Sindhu's positives, Sat-Chi's warning\nA return to basics has resulted in Lakshya Sen's uptick in form - with the Paris Olympics looming closer. Shi Tang/Getty Images\nAnother All England Championship has come and gone and India's wait for another title at the oldest badminton tournament continues.\n2024 had seemed a good chance to end the drought: especially with men's doubles top seeds Satwiksairaj Rankireddy and Chirag Shetty in red-hot form. However, they went out in the second round, as did PV Sindhu. Lakshya Sen, who reached the semifinals after a couple of stunning wins, was the last Indian standing while fellow men's singles players all lost in the first round.\nHere's a look at the takeaways for Indian badminton from 2024 All England, and what it means for the season ahead with the end of Paris Olympics qualifications on the horizon:\nLakshya Sen rises again\nThis All England marked a full circle, or rather, a triangle for Lakshya.\nTwo years after his breakthrough, reaching the final of the 2022 edition, and two months after his lowest point on tour after seven straight first-round exits, Lakshya appears to have found his mojo back with two back-to-back semifinals.\nIn Birmingham, he did a full 2022 throwback, beating world No 3 Anders Antonsen and 2021 champion Lee Zii Jia in tough three-game battles that brought out the best of his game - quick-footed and counterpunching, with the much-needed added element of composure.\nThat he went down to Jonatan Christie in the semis may seem like a missed opportunity in an open field, but the 22-year-old has accomplished the much tougher task of overturning a mental slump. A deep run at a prestigious Super 1000 where the best players in the world struggled validates what his childhood coaches Vimal Kumar has been saying - physically his game was all there, it was a matter of confidence.\nThe best part of this run is that the bounce was back in his step - he played a clean game with very good body language, something that had deserted him during his low period.\nThis would have been the shot in the arm he needed, both for his game and his place in the race to Paris Olympics. Currently 15th in the BWF Race to Paris rankings, he needs to remain in the top 16 to qualify.\nSatwik-Chirag and men's doubles minefield\nThe biggest upset from an Indian perspective was Satwik and Chirag losing in the second round in straight games.\nMuhammad Fikri and Bagas Maulana beat them 16-21, 15-21 to end their 5-match winning streak as well as their four-final run, playing a tactically smart game from the front court to outfox them.\nIt wasn't a terrible result, though. They may have been the top seeds, but they lost to the 2022 All England champions, who then lost in the next round to the former world champions Soh-Chia. Meanwhile, the reigning world champions Seo-Kang lost in the first round and the second seeds Liang-Wang were also knocked out in the second round, by the reigning Olympic champions Lee-Wang.\nSimply put - this situation is reflective of the current men's doubles landscape, which has become increasingly competitive in the last couple of years and any pair can beat the other on their day. This in turn automatically makes player performance look more erratic that it is.\nRight now, there is not much to read into Satwik-Chirag's All England run except that they missed a major goal of 2024 - to reach the final of the Super 1000 they never have before. However, nothing motivates Satiwk-Chirag more than losses and this can add fuel to their fire in an important season.\nSindhu has positives to count\nOn paper, Sindhu had one walkover and lost the next match in Birmingham. On court, though, the second-round loss (19-21, 11-21) to world No 1 An Se Young is more than just an early exit.\nYes, this was her seventh straight loss to the South Korean but it's a loss to take some heart from. Like in her loss to Olympic champion Chen Yu Fei at the French Open, Sindhu showed glimpses of her vintage self. She was quick on her feet, tactically more aware and played some brilliant shots to fight back and put herself in a good position against a tough opponent.\nThis is more than she was able to throughout 2023, when she was coming back from a five-month injury layoff.\nHer comeback from the latest fourth-month injury layoff in February has started much better. Building up to the Paris Olympics, Sindhu raising hopes of returning to her pre-2022 surgery phase is one of the best takeaways for Indian badminton.\nWhat do we make of Prannoy's blip?\nHS Prannoy, who had the best year of his career in 2023, has been the only seeded Indian in singles for a while now by virtue of his consistency. In fact, he has already mathematically qualified for the Paris Olympics - his first ever - because of his steady run.\nHowever, the world no 8 has now lost three straight first-round matches on the BWF Tour, the last two to unheralded players. He reached the semifinal of the India Open Super 750 in January and won only one of three matches at the Badminton Asia Team Championship in February.\nIt is too early to state if this a cause for concern and he himself must be disappointed with his loss -- having shared that his father has travelled to watch him at All England for the first time. He has not entered the next to BWF Super 300 events in Europe either, likely in an attempt at managing his fitness.\nPrannoy's form, though, is something to keep an eye on as the season progresses.\nThe all-Indian women's doubles battle\nIn women's doubles, there is an interesting battle brewing between Treesa Jolly and Gayatri Gopichand - who were the India No 1 pair for a long time before injury concerns pulled them behind in 2023 - and Tanisha Crasto and Ashwini Ponnappa, a newer pair who climbed up the ranks with a good end to 2023 - for the Paris Olympics qualification spot. This adds another layer to all their BWF World Tour performances.\nCurrently, they are neck-to-neck at world No 22 and 23 in the world respectively but Tanisha-Ashwini are a little ahead at 11 to the other's 14 in the Olympics race. The top 16 spots usually qualify for the Olympics.\nAt All England, Treesa and Gayatri lost in the first round, ending their streak of two straight semifinals, which will affect their points. Ashwini and Tanisha, meanwhile, beat a higher ranked pair and reached the second round of the Super 1000, which will give them a big boost.\nThe cut-off is at the end of April, and this adds more intrigue to the Indian results in women's doubles."
    },
    {
        "Category": "Sports",
        "Article": "Jonatan Christie beats Lakshya Sen in three-game thriller, sets up All Indonesian final at 2024 All England Championships\nJonatan Christie of Indonesia celebrates after winning the Men's Singles Semi Final against Lakshya Sen of India at the All England Open Badminton Championships 2024 Catherine Ivill/Getty Images\nThe All England Championships will see an All Indonesian men's final in 2024 after Jonatan Christie beat India's Lakshya Sen 21-12, 10-21, 21-15 to join Anthony Ginting (who beat France's Christo Popov 19-21, 21-5, 21-11) in the title clash.\nIn the second men's semi of the day, Christie started rapidly.. flying out of the blocks. spraying his trademark jump smashes across Lakshya's court (and body). It was close in the early stages, 6-6 as Lakshya kept up pace with the furious shot-making with some superb smashes of his own, but after opening up a four point lead at the mid-game break (11-7), Christie didn't really look back. Some delightful touches at the net and those smashes directed at the body kept Lakshya guessing and there was little he could do as he closed the game out with the first of his eight game points, taking it 21-12.\nThe second started similarly with a quick exchange of points but 3-2 for Lakshya became 6-3 and then Christie completely broke down. All his smashes went well wide, his drops found the net or drifted out of bounds, even his regulation clears were wayward. Those that remain inbounds were dispatched superbly by the alert Lakshya and from 6-3, he took an incredible 17-4 lead. A mini rally for Christie got him six more points but by then Lakshya had also drawn away, and he closed out the game 21-10. Considering how near-perfect Christie had been in the first game, this was a strange, sudden reversal that Lakshya took the utmost advantage of.\nAhead of the third game, the great Prakash Padukone, travelling with Lakshya (and PV Sindhu), was heard giving him some advice: \"[Christie] will come out fast early on, you have to be prepared for it\". And prepared he was as he went 2-0 up, and then 5-3 up... by now he was controlling the pace and intensity of the rallies and relying on a combination of his patience and Christie's wayward aggression to seize control of the game. Said control was short lived though as Christie changed up tactics to make it 6-6. He let go of the early smash-to-kill strategy that had won him the first game and lost him the second and adopted a more a patient approach, trusting his defence to open up gaps in Lakshya's armour. By the time 7-7 became 8-8 and then 10-8 in favour of Christie, he knew he had the upper hand. Going into the decisive mid-game break 11-9 up, he opened up his full array of strokes again -- one in particular, where he leaned back and hit an overhand inside-out smash that flew down the line at an angle that Lakshya neither predicted nor could do anything about. That smash made it 16-12 for Christie and from there it was routine as he made it 20-12. Despite Lakshya's late resistance saving three of those eight match points, Christie closed it out with a delicious drop angled cross-court.\nLakshya's loss, meanwhile, meant that was the end of India's participation in Birmingham. Zenia D'Cunha will have her analysis of how the country's athletes fared this week up on the site by Sunday morning, but until then, you can relive the exciting semifinal (includes bits from the superb Akane Yamaguchi vs An Se Young semifinal that happened before this one) right here with our blog (Please wait a few seconds for the blog to load. If it doesn't please click here):"
    },
    {
        "Category": "Sports",
        "Article": "Lakshya Sen reaches All-England semifinal by returning to basics\nLakshya Sen celebrates after winning the quarterfinal against Lee Zii Jia at the 2024 All England Badminton Championships. Catherine Ivill/Getty Images\nTwo months ago, Lakshya Sen was mired in a terrible slump, looking lost after seven straight first-round exits on the BWF Tour.\nToday, Lakshya Sen has reached back-to-back semifinals in two straight weeks of the BWF Tour - at a Super 750 and Super 1000 tournament (the two highest tiers) looking supremely confident against some of the best players in the world.\nThe 22-year-old Indian made the semis at the prestigious All England Championships after stunning comeback wins against world No. 3 Anders Antonsen and 2021 champion Lee Zii Jia in the span of two days.\nAgainst the Dane, he came back from a poor second game and 2-8 down in the decider to grab the final 8 points in his 24-22, 11-21, 21-14 win. Against the Malaysian, he fought back from a game down to win 20-22, 21-16, 21-19. The scoreline margins indicate how the final phase was a test of nerves as much as skill. Both times, he was the underdog and under pressure, both times he emerged victorious by being calm and playing his own game.\nFollow LIVE: Lakshya Sen vs Jonatan Christie\nThe unseeded Indian showed the full range of his counter-punching prowess and speedy court-work, this time underlined by an exceptionally composed demeanour that has piled the pressure on his opponents as much as his skillful defence. He did that in Paris last week - where all his wins came from a game down - and he has backed it up in Birmingham, with the presence of childhood coaches Prakash Padukone and Vimal Kumar on the bench behind him. It's a complete U-turn and it's come at the best time possible - with the Paris Olympics looming closer.\nThis Lakshya looks nothing like the dejected player at the India Open in January, plainly admitting that he was yet to process his latest loss to even think of the future. This Lakshya looked more like the 20-year-old breaking through the ranks back in 2022, reaching the final of All-England; beating Antonsen and Lee then as well.\nHow did he turn it all around?\nIn New Delhi, Vimal Kumar spoke about how Lakshya's issues were more mental than physical. His collapses stemmed from a lack of confidence rather than a technical glitch. The best way to solve them, the coach believed, was to not overthink but go back to his basics and put together a few wins.\nDIY: How childhood coach Vimal Kumar hopes Lakshya Sen can get his mojo back\nConquering mental opponents is easier said than done but Lakshya has apparently managed to do just that. He is not only sticking to his basics of a quick, counter-punching game which can easily transition into attack when the opportunity arises, but he is doing it with complete confidence and composure.\nThe 22-year-old did this multiple times against Lee, keeping the rallies on his racquet and forcing his opponent to do something extra while he remained steady. Lakshya was leading 8-3 to start the match before Lee reduced it to 9-8 and then levelled things at 12-12 and 16-16. They were battling it out in versatile rallies and smashed winners, with Lee often overhitting and Lakshya anticipating the errors. It was Lee who had three game points but Lakshya saved them all with great shots under pressure. On his fourth, he converted when Lakshya hit long - reiterating that the points were more often decided by the Indian's actions.\nThe way Lee took the first game where Lakshya looked like the better player is a testament to the Malaysian's talent. Later however, the erratic tag that often describes him proved to be the difference.\nLakshya, in the second game, stayed consistent and once again had the lead at the interval with more varied retrieving. The second half, however, was much closer with very small margins. Lee, looking to be the one to end points, committed a bunch of errors and got more cautious while Lakshya used the chance to force more mishits and eventually a decider. The Indian varied his pace and shots well to take charge of points.\nThe decider was much tighter with no real lead to either player. But where Lee was sharp at the net and nailing smashes sporadically, Lakshya was constantly directing shots all over the court and had the interval lead once again as well as the momentum.\nThe second half was not the cleanest of games but Lakshya's patience while Lee looked worried was a key difference. There was a superb rally at 13-16 where Lakshya won with his variety and smarts, a dogged defence ending with a smashed winner.\nLee Zii Jia ���� competes against Lakshya Sen ���� in a hard-fought matchup.#BWFWorldTour #AllEngland2024 pic.twitter.com/wFqMCJh8G1\n- BWF (@bwfmedia) March 16, 2024\nBut just as the Indian saw the finish line at 18-14, came the final twist as Lee levelled things at 19-19 with a cracking angled smash after a brief medical check for his arm. It was the moment of truth for Lakshya and those final 2 points went back to what coach Kumar had said so long ago. Lakshya forced Lee to mishit with quick parrying and then Lee pushed his return long, as he had so often in the match.\nLakshya stuck to his basics and found confidence to reach the All-England semis once again - a full circle of sorts. Two years after his breakthrough and two months after his lowest point, Lakshya Sen discovered, or rather rediscovered, the core of what made him stand out as a badminton player.\nNext, he faces Jonathan Christie, whom he trails 1-2 in their head-to-head, for a place in the final. If he can continue playing his newfound old game, Lakshya can find something as precious at the oldest badminton tournament in the world."
    },
    {
        "Category": "Sports",
        "Article": "Today's NBA is harder on LeBron James, Steph Curry than ever before\nSunday afternoon after a valuable victory for the Los Angeles Lakers in New Orleans, LeBron James asked aloud how many games he ended up playing in his just-concluded 21st NBA regular season.\nThe answer was officially 71, but really 72 if counting the in-season tournament championship game which awkwardly isn't counted. That's 16 (17, unofficially) more games than last season and the most in his six-year tenure with the Lakers.\nJames shook his head in satisfaction.\n\"That's pretty cool,\" James said. \"At this point in my career to play 70-plus games and be available for my guys.\"\nThis is reality. To be 39 years old, the oldest active player in the league, and dealing with some chronic injuries to his left ankle and right foot and long-term maintenance of other areas such as his lower back, to play that many games is indeed cool.\nThe Lakers finished the regular season 47-35, four games better than last season, and James thought that was pretty good, too.\n\"To end the season 12 games over .500, 13 if you count the championship of in-season tournament, for everything we went through,\" James said, \"it's a pretty good season for us.\"\nThis is reality, too. The Lakers finished the season winning 13 of their last 18 games and slipped into eighth in the West at the finish line after spending months stuck in ninth or lower.\nBut for James, reality is easily skewed. He doesn't live in a world where \"good\" seasons are accepted at face value.\nHe shares this status with 36-year-old Steph Curry, who will also compete in Tuesday's play-in tournament. The Golden State Warriors will play the Sacramento Kings just after James takes on the New Orleans Pelicans as the West teams fight to gain entry to the playoffs.\nJames and Curry are superstars of a certain age. Their dominance in their primes and extended run of winning at the highest level has made anything less than that seem like failure.\nBetween 2011 and 2022, either James or Curry played in the Finals for 11 out of 12 years. They played against each other four times. Last season, they played in a series that smashed television ratings records as the Lakers won and James reached his 12th career conference finals.\nWhen this is your résumé, you aren't afforded the luxury of simply maximizing your current team's chances. James and Curry are judged aggressively both against ghost adversaries who have long retired and against themselves when they were younger, healthier and played in a less competitive league.\n\"This last 30 games has just been 'Operation: Give ourselves a chance,'\" Curry said last week.\n\"You could look at it a lot of different ways. You could look at our record [down the stretch] and extrapolate that out for 82 games and you're probably not in this situation. But all the things we've gone through and the way the West is stacked, that's our situation. Doesn't really matter.\"\nThe Warriors were 19-24 in late January with Draymond Green suspended, Chris Paul injured and Klay Thompson stuck in a long slump. Stories leaked about role players undermining coach Steve Kerr, and Curry himself was quoting the definition of insanity.\nThe Warriors then went 27-12 to finish the season. But if they lose one of their next two games, they will surely sit through a torrent of \"end of the road\" storylines.\nIn 2016, when they blasted the league en route to 73 wins, the Warriors' current 46-36 record would've had them in the No. 5 seed. The conference's depth now is totally different, and the margin for error is the tightest it has been in the past two decades.\n\"This whole season has been weird,\" Curry said.\nThe Lakers just completed their second-best regular season in the past 13 years, behind only the 52-win season in 2019-20 that ended in a title. This season, if they have a bad week, James and the Lakers will deal with heavy fallout simply because of the expectations that have been established for the franchise.\nLike the Warriors, the Lakers will be awarded no bonus points based on a perspective that looks at the entire lay of the land.\n\"I took a lot of pride in the offseason in getting my foot, my ankle back in order, getting my body back in order,\" James said. \"And it's definitely paid off for me.\"\nIn addition to getting healthier, James adjusted his shooting form and finished the season at 41% from 3-point range, the best of his career. This will end up being a footnote to a footnote.\nCurry played in 74 games, his most in seven seasons. He had his 10th season of shooting at least 45% overall, 40% from 3 and 90% from the line. But there is next to no interest in this statistic -- Curry normalized great shooting years ago.\nInstead, he and James will eventually trudge off to the summer, likely listening to plenty of talk about how they've won their last NBA championships ... when they join up in Paris for Team USA in an attempt to win an Olympic gold medal.\nThis is James and Curry's existence. They are used to heavy expectations and doomsday predictions, and the presumption will be no different this week.\n\"You can't avoid those conversations; they've been hovering over us [for years],\" Curry said Monday. \"When you're out on the floor as a player performing at that level and understanding what's expected of yourself and your team, that environment brings the best out of you.\""
    },
    {
        "Category": "Sports",
        "Article": "NBA playoffs 2024: Two under-the-radar trades turned the Mavericks into a real West threat\nEditor's note: This story was originally published on April 27. On Friday, the Mavericks reached the conference semifinals after defeating the LA Clippers in Game 6.\nJUST SECONDS INTO Daniel Gafford and P.J. Washington's debut as Dallas Mavericks on Feb. 10, roughly 48 hours after being moved at the trade deadline, Gafford sensed an opportunity.\nLuka Doncic had the ball on the left wing and the full attention of the Oklahoma City Thunder, drawing two help defenders. OKC guard Isaiah Joe was left as the low man, giving Gafford a size advantage of seven inches and about 70 pounds -- if he acted quickly.\nGafford established position on Joe and made eye contact with Doncic, who took one dribble toward the middle of the floor and delivered a leaping lob over the top of the defense. Gafford grabbed the pass with two hands and threw it down.\nTwenty-four seconds later, he dunked again off a Doncic assist, drop-stepping and finishing over Thunder guard Shai Gilgeous-Alexander after catching a 75-foot outlet pass.\n\"Right spot at the right time,\" Gafford told ESPN, referring more to his fit with a new franchise rather than his positioning during the highlight plays. \"I was like, 'It's going to be a good time being here with this team.'\"\nAnd on Dallas' next possession, Washington scored his first bucket as a Maverick in spectacular fashion, catching an alley-oop that Doncic delivered from near half court.\nGafford and Washington's instant collaboration with the franchise's superstar guard was a sign of things to come for a revamped Dallas roster. The Mavs, in stark contrast to last season's lottery team, suddenly feature a high-flying supporting cast to complement Doncic and co-star Kyrie Irving.\nDallas general manager Nico Harrison was adamant after last season's disappointing finish that the team's issue wasn't the fit between Doncic and Irving -- the injury-riddled duo recorded a 5-11 record when in the lineup together -- but the \"surrounding pieces.\"\nOver the course of the offseason and the trade deadline, Harrison has executed his vision of turbo-boosting the rest of the rotation by adding several dynamic players via the draft, free agency and trades: All-Rookie candidate center Dereck Lively II, guard Dante Exum, forward Derrick Jones Jr., Washington and Gafford.\nThe group's impact was evident in Dallas' win over the LA Clippers on Friday to take a 2-1 series lead heading into Sunday's Game 4 (3:30 p.m. ET, ABC). The Mavs threw down 13 dunks in Game 3, the second most in a playoff game in the past 25 years, according to ESPN Stats & Information research. Eight of those were alley-oop finishes, more than any team had in a game this season or in the past 20 postseasons.\n\"Last year we could only do the layup line,\" Mavs coach Jason Kidd told ESPN. \"This year we could participate in a dunk contest.\"\nTHE COST OF Dallas' wheeling and dealing, beginning with the blockbuster February 2023 trade to acquire Irving from the Brooklyn Nets, has been significant.\nThe Mavs, who will finally pay off the failed Kristaps Porzingis trade by sending the New York Knicks their first-round pick in the upcoming 2024 draft, have given up control of their first-rounders from 2027 through 2030, either outright or via swap rights.\nAfter this season's trade deadline, one Western Conference executive told ESPN the Mavs' future felt \"very precarious.\" After all, if the moves weren't impactful enough to push the Mavs into elite status, fears of Doncic becoming frustrated enough to leave the franchise could come to fruition.\nBut the moves paid immediate dividends. Due in part to early injuries, Dallas was in eighth place in the West at the trade deadline. Harrison joked that Kidd had to use \"tape and bubble gum\" to piece together lineups for much of the season's first few months.\nThe Mavs went 21-9 after the deadline, the third-best record in the NBA in that span.\nHarrison, who readily acknowledges \"there's always going to be a sense of urgency\" with an MVP candidate as the face of the franchise, said the Mavs made the trades with the long-term view in mind, adding a pair of 25-year-olds under reasonable contracts in Gafford and Washington.\n\"It wasn't really about winning right now,\" Harrison told ESPN. \"It was just about continuing to build it. It's like every step is, how do we continue to get better? And we're not built for just right now; we're built for the next three playoff runs.\"\nDoncic, who had his best season with a league-leading 33.9 points, 9.2 rebounds and 9.8 assists per game, has enthusiastically provided input to the front office over the past two seasons and has gushed about the team's chemistry, which he cited as a problem a year ago.\n\"We're just having fun out there,\" Doncic said after a March 29 win over the Sacramento Kings. \"[Kyrie and I are] both happy. We're both doing some good things on the floor, and we have great teammates. I think this team is special.\"\nHARRISON SMILED WHEN he heard Washington discussing defense during the midseason trade acquisitions' introductory news conference, a few hours before they made their Dallas debuts in the win over the Thunder.\n\"We're going to be holding him accountable, but he can actually do a lot of things that he doesn't show all the time because the game comes easy to him,\" Harrison said then. \"We'll make sure to push him to get the best out of him, but he really does have it on both sides of the ball.\"\nWashington did not have a reputation as an above-average NBA defender at that point. His former team, the Charlotte Hornets, had a bottom-three defense and allowed more points per 100 possessions with Washington on the court than off it this season.\nBut Harrison, a former Nike executive, had known Washington since he was on the AAU circuit as a teenager. Harrison saw Washington use his 6-foot-7 frame and 7-2 wingspan to smother elite scorers. He wanted it known that Dallas would demand that from him.\n\"It was a confidence-booster for me,\" Washington told ESPN. \"I feel like Nico knows who I am. He's been around me since high school, so for him to just say those things, it just felt great. I just wanted to piggyback on that and just be aggressive on the defensive end.\"\nGafford was also part of a bottom-three defense with the Washington Wizards, who were also worse statistically on that end of the floor with him in the lineup. But the Mavs believed that Gafford would thrive in a more competitive environment, giving them a tag-team partner for Lively and allowing Kidd the option of always having a lob threat and rim protector at center.\n\"No disrespect to any other team that we were on, but it's just we went from playing for nothing to playing for something,\" Gafford said. \"It's like we had to lock in a whole different way.\"\nIt took some time and lineup tweaks for Dallas to morph into a dominant team, however.\nThe Mavs lost five of their first six games after the All-Star break while ranking last in the league in defensive efficiency during that stretch, which Harrison refers to as \"a very uncomfortable period.\" Speculation swirled among rival executives about the job security of Kidd, who has one season remaining on his contract.\n\"Rome wasn't built in a day; 2011 wasn't built in a day,\" Kidd said, referring to the Mavs' lone title season after a 137-120 home loss to the Indiana Pacers on March 5.\nKidd changed the lineup two nights later, plugging in Jones and Gafford and moving Josh Green and Lively to the bench, and the Mavs took off. Dallas won 10 of its next 11 games -- the lone loss came when Doncic stayed home due to hamstring soreness on the second night of a back-to-back -- and 16 of 18. Kidd is now well-positioned to sign a contract extension this summer.\n\"J's done a great job,\" Harrison said of Kidd. \"I honestly think he's the best coach to lead this team. I think having the two stars that we have, close your eyes and pick whoever you want, you're not going to find a better fit.\"\nDallas ranked first in the league in defensive efficiency for the final six weeks of the season. That trend has carried over into the first round of the playoffs, with the Mavs holding the Clippers to 93 and 90 points in their two wins.\n\"It first starts with asking them, 'Can you do this?'\" Kidd said. \"And they said they could. So sometimes things are simple -- ask and they said they could. Then just keep showing them [on] film how to get better. They have been sponges and absorbing that information and have been doing it at a high level.\"\nThe Mavs are optimistic they have found a formula that can work for the foreseeable future. Jones, a former dunk contest champion who is thriving in the most significant role of his career, is the only rotation player whose contract expires at the end of the season and there is mutual interest in his return.\n\"I think what we did this year, regardless of what happens in the playoffs, we start next year at a high level,\" Harrison said. \"We're not starting at, 'Hey, can Luka and Kyrie play together?' We know that. ...\n\"You're not answering a bunch of questions. You're like, 'How good can this team be?'"
    },
    {
        "Category": "Sports",
        "Article": "Kyrie Irving vanquishes Clippers in Game 6 as Mavericks move on\nDALLAS -- Kyrie Irving danced with his dribble, crossing over a few times in front of Clippers forward P.J. Tucker, before sidestepping and launching a 3-pointer from the corner in front of the Mavericks' bench.\nThe Mavs were up 20 midway through the fourth quarter, putting the Clippers on the brink of elimination, and Irving was putting the exclamation point on his spectacular closeout performance. He got fouled by Tucker as he launched the jumper and mobbed by his teammates when the shot splashed through the net.\nIt was an instantly iconic moment, the most memorable highlight of Irving's scorching second half in the Mavs' series-clinching 114-101 win Friday night at the American Airlines Center.\n\"I was on the floor looking, kind of squinting and seeing if it went in,\" Irving said after improving his record to 13-0 when his team can clinch a series during his career, the best record in closeout games in NBA history. \"Just seeing my teammates' reactions, that was the best part of it. We knew that was kind of like the dagger in the series.\"\nIrving scored 28 of his 30 points after halftime as the Mavs earned the right to advance to face the top-seeded Oklahoma City Thunder in the Western Conference semifinals. That matched the most of any playoff half of his career, according to ESPN Stats & Information research.\nMVP candidate Luka Doncic finally got the best of the Clippers, the franchise that eliminated Doncic's Mavs in the first two playoff series of his career, in large part because of Irving's poise and brilliance. Doncic struggled by his standards in the series while dealing with a right knee sprain he anticipates won't fully recover until he can rest this summer, averaging 29.8 points, 8.8 rebounds and 9.5 assists but shooting only 40.5% from the floor in the six games.\nIrving excelled throughout the series, averaging 26.5 points on 51.4% shooting -- and he was especially dominant after halftime. He averaged 20.0 points in the second halves of the six games, shooting 60% from the floor and 53% from 3-point range.\n\"I would say unbelievable,\" Doncic said after scoring 28 points on 9-of-26 shooting while adding seven rebounds and 13 assists in the elimination game. \"So it's even more special, but just to have the guy like that on your team, it's a pleasure. Just working with him, just playing with him, it's a pleasure no matter what. He's always positive energy, always. Not even one second of negative energy, which helps a lot, helps everybody and we're so happy to have him.\"\nThe score was tied at halftime after Irving scored only two points on 1-of-6 shooting in the first two quarters.\nAt one point in the second quarter, Doncic was making a concerted effort to get Irving more involved. Irving calmly assured his co-star that he would find his groove within the flow of the game.\n\"Never a doubt with Kai,\" Doncic said with a smile.\n\"He don't force anything,\" Mavs forward Derrick Jones Jr. said. \"He lets the game come to him and he knows the perfect moments where he should be more ultra-aggressive.\"\nIrving and the Mavs seized control of the game immediately after halftime. Dallas opened the third quarter with an 8-0 run to take the lead for good. The spurt started with Irving finishing a fast break with a layup off a feed from Doncic and ended with an Irving 3 in transition.\n\"You give someone like Kai those looks, that basket gets bigger and bigger,\" Clippers star Paul George said. \"I thought that was really all he needed to see. Everything else was a playground for him.\"\nIrving scored 13 points on 5-of-6 shooting in the third quarter as the Mavs pushed their lead to 15 points. He had 15 points on 5-of-7 shooting in the fourth quarter as Dallas prevented the Clippers from ever mounting a comeback threat.\n\"It was like 2K,\" Mavs forward P.J. Washington said. \"He had a Mamba takeover. He was just doing what he does. He's special, and I'm just glad to be on his team.\"\nIrving also dominated on the defensive end of the floor. According to ESPN Stats & Information tracking, the Clippers were 2-of-18 from the floor with Irving as the primary defender in Game 6.\n\"I just got to get there to that point to be able to be ready to have the other team submit,\" Irving said. \"One of the hardest things to do as a competitor is to have your opponent concede or submit. And I do want to take this time to give respectful shoutout and also show my respect to the Clippers organization and the players. It's always fun, and they got me better.\""
    },
    {
        "Category": "Sports",
        "Article": "Paul George, James Harden mum on future as Clippers fall again\nDALLAS -- After losing in the first round with Kawhi Leonard injured for the second straight postseason, the LA Clippers head into the offseason with uncertainty surrounding the futures of Paul George and James Harden.\nGeorge has a player option for next season worth $48.8 million and can become a free agent if he and the Clippers are unable to agree on an extension prior to June 30. Harden will be an unrestricted free agent and may wait to see what happens with George first before figuring out his future with the Clippers.\nFollowing the Clippers' 114-101 loss in Game 6 at Dallas, George was asked if he sees himself with the Clippers long term alongside Leonard and Harden.\n\"Yeah,\" George said. \"If it works that way, absolutely.\"\nAfter the Clippers' season came to an end, George and Harden said they haven't really thought about their contracts yet.\n\"I don't even know,\" said Harden, who finished with 16 points, 13 assists and 7 rebounds but missed all six of his 3-point attempts on Friday. \"You are asking a lot of questions that I don't have the answer to or haven't even thought about.\"\nThe Clippers have a busy offseason ahead of them as far as trying to keep this team intact. The franchise is planning to pursue a contract extension with Ty Lue to avoid having the head coach enter the final year of his deal in 2025-26, sources told ESPN's Adrian Wojnarowski on Friday.\nAnd then there's George and Harden. Leonard signed a three-year, $153-million extension in January. With the Clippers likely to exceed $200 million in payroll next season, they will be restricted in how they can improve the team due to the second apron.\nShould George become a free agent, there could be multiple suitors for the 34-year-old.\nGeorge played 74 regular-season games this season, the most he's played by far in his five seasons with the Clippers. The All-Star averaged 22.6 points, 5.2 rebounds and a career-high 41.3% from 3.\nAfter trading for Harden in late October, the Clippers eventually took off and went on a 26-5 tear in the middle of the season to reach the top of the Western Conference standings in early February.\nBut the team sputtered after that due to injuries and inconsistency. Leonard missed the final eight games of the regular season and Game 1 of the first round with inflammation in his surgically-repaired right knee. He played in Games 2 and 3 before the team held him out after he didn't look like his normal self in Game 3.\nGeorge, who finished with 18 points and 11 rebounds but shot 2-for-10 from 3-point range in Game 6, said he will talk about his future with his family and loved ones soon.\n\"I'm not even focused on that yet,\" George said of his future. \"I got a lot to kind of digest myself, so I haven't even got to that yet. Look forward to kind of going back, just letting everything kind of decompress, talk to my family, be around family support and then address the next step... Yeah, it's just not where I'm there. I'm not there yet.\"\nESPN's Bobby Marks contributed to this story."
    },
    {
        "Category": "Sports",
        "Article": "India's Australia tour ends in 0-5 loss, but plenty of learnings ahead of Paris Olympics\nHockey India\nWhen the Indian men's hockey team travelled to Australia in December 2022, they scored 17 goals, conceded 25 and won one game out of five.\nJump to 2024, India managed only seven goals, conceded 17 and did not win even one of the five matches.\nWinning a series in Australia is a tough proposition and this tour was not all about results. This was in preparation for the Paris Olympics, where India are hoping to upgrade their Tokyo bronze medal. But the above numbers do tell a story. Craig Fulton's India played a brand of hockey where the defence did decently, but the attack was toothless throughout.\nThe big problem\nFulton took as many as 10 forwards to Australia, in the hope that stiff competition among the Olympic hopefuls will propel the players to give their best. Unfortunately, not one Indian forward impressed. The numbers are also damning: just one goal was scored by a recognised forward -- Gurjant Singh -- and overall India could score only two field goals with the other one coming from Boby Singh Dhami.\nThe lack of goals and chances created by the forwards made a big impact. Indeed, Fulton's style is not best suited for forwards who love to race ahead at every given opportunity, but even then, it's disappointing to see experienced forwards like Mandeep Singh, Abhishek and Akashdeep Singh not being consistent enough.\nThere were many occasions where the attackers were either too slow in counter-attack situations or ended up committing silly errors like mistraps and miscontroling simple passes. It's understandable if it's just one or two matches, but to see such issues last an entire series is far from ideal.\nAnother stat to judge how Indian forwards faltered was the number of penalty corners that Australia won. In five matches, Australia had 31 penalty corners compared to India's 18. It shows how Australia's attackers managed to create more set-piece chances. Dragflick extraordinaire Jeremy Hayward was the big difference in the series, scoring seven goals, and it's because India gave him plenty of opportunities to have a go at their goalkeepers.\nFulton will hope his forwards will improve in the upcoming matches, especially in the Pro League away games. Going into the Olympics with out-of-form forwards can spell doom.\nWhat did India do right?\nWhile it's difficult to figure out the positives from a series like this, there was improvement on the defensive side of things, especially after the first two matches. The low block did its thing in making it difficult for Australia to find goals from open play. Key defenders Amit Rohidas, Jugraj Singh and Harmanpreet didn't start well but improved on the tackles and interceptions as the series progressed.\nFulton ensures his teams have strong defensive setups so it's natural he focussed on improving the defence. The goalkeepers also did their part, with a special mention to Suraj Karkera. In a way, Suraj is a third-choice goalkeeper who doesn't get many chances to play international matches.\nThis time, however, Fulton took him to Australia and Suraj impressed with his shot-stopping skills. There was a period in the fourth match where he pulled off four back-to-back saves and later continued his form in the final match as well.\nStandout player for India\nAs mentioned above, Indian goalkeepers had a decent tournament, but legendary PR Sreejesh was clearly India's best player in this tour. He was the most in-form player going to Australia, having produced an outstanding show in the Pro League home matches. He continued the same form against Australia, where he pulled off several important saves, especially in set-pieces.\nGenerally, Olympic squads allow just only goalkeepers in the squad. Krishan Pathak has given a tough competition to his senior partner over the last few years but currently, Sreejesh is the clear favourite to take the only spot in the Olympic squad.\nHow to read the 0-5 series loss?\nLosing all five matches might give the impression that there are serious problems with the team in an Olympic year, but that's not accurate. No doubt India should've done better in the five matches, but we don't need to read too much into the results as long as this tour served as a learning experience.\nFulton will hope that India will be better prepared when they face Australia at the Paris Olympics as both are placed in the same group. He would also have gotten a clear picture of the squad that will go to Paris basis this tour.\nMore importantly, despite the defeats, India competed and showed they could frustrate their opponents by stopping them from playing their natural game. Again, this wasn't done consistently and Australia did not commit big mistakes, but it's a gameplan that can work.\nIt worked against Australia and European teams at the Pro League and it worked at the Asian Games where India won the gold. There is no need for drastic changes to this team and Fulton will be glad that he got to play these five tough matches because now he has the opportunity to work on concerned areas.\nWhat's next?\nIndia will be back home and start their camp in Bengaluru ahead of Pro League away matches. They will travel to Belgium and England in the second half of May to play the rest of the Pro League matches."
    },
    {
        "Category": "Sports",
        "Article": "Australia complete clean sweep with 3-2 win over India\nHockey India\nThe Indian men's hockey team's Australia series ended without a high as the home team maintained their winning momentum with a 2-3 victory in the fifth and final match.\nCraig Fulton made eight changes with Hardik Singh and PR Sreejesh being rested for Saturday's match. Considering Australia's form and with many changes, it was a tough proposition for India to find a win. However, India started the match really well, created a few chances and scored the opening goal.\nIt was the fourth time that India took a lead in the series and once again, it was Harmanpreet Singh's rocket from a penalty corner. Only four minutes had gone on the clock when India took a 1-0 lead. Australia's attacking hockey was not its best as they struggled to create clear-cut chances in the opening quarter.\nThe home team found the equaliser in the 20th minute when Jeremy Hayward smashed in from the team's first penalty corner of the match. He has been a big difference in the series, often turning the matches around with his dragflicks. This was his seventh goal of the series, out of which six came from penalty corners.\nOnce Australia equalised, they were back to being their best. They found their groove and kept entering the Indian circle from all sides. India somehow managed not to concede in the second quarter but eventually Ky Willott came up with a cheeky finish to give his team the lead in the 38th minute. A minute later, Tim Brand took advantage of sloppy defence as he found plenty of space inside the circle to score Australia's third goal.\nIn the final quarter, India showed urgency on the ball and it was in fact youngster Boby Singh Dhami who scored India's second goal and reduced the deficit. Dhami was one of the best players on the pitch, impressing with his trickery and high work rate. India pushed for an equaliser but Australia's defence did the job to secure the win.\nRelive the match on our blog:"
    },
    {
        "Category": "Sports",
        "Article": "India improve attack but Australia remain too high a mountain to climb\nIndia's counter-attacking didn't click against Australia, leading to a cleansweep loss in the series. Hockey India\nAnother match and another loss to Australia for the Indian men's hockey team.\nBefore the start of the five-match series in Australia, there was hope that Craig Fulton's India could make things very difficult for their opponents. Come up with a couple of wins, even if not the series. After four matches though, chances of at least one win seems difficult with Australia proving too good to beat in their home.\nOn Friday, India hoped for a better attacking performance, which they did but that was not enough. For the third match on the trot, India took the lead but couldn't stop their opponents from hitting back.\nJeremy Hayward did what he does the best, scored a brace from penalty corners and then Jack Welch added the third from his dragflick. In the end, it was a 3-1 victory.\nHow the match turned in the final quarter\nIt was clear in the previous game that India made defensive improvements that were needed to stop Australia from creating chances non-stop. The low block that India employ can result in maximum ball possession for Australia but reduces clear-cut chances from open play. Friday's match was no different, but Australia are not a team that gets frustrated and make mistakes.\nWhile India's defence held up again, the attack showed a much-needed change in intensity and started having an impact in the game. The likes of Mandeep Singh, Abhishek, Sukhjeet Singh, and especially Araijeet Singh Hundal, were much better with the ball - quick in making passes and executing their shots.\nIt was also important for India's attackers to create chances and win penalty corners because that's when Harmanpreet Singh can press in his advantage. That moment came in the 12th minute when Harmanpreet smashed a dragflick that Australia had no chance of stopping. This chance was the result of an impressive bit of stick play by Abhishek to find the foot of a defender.\nWith so much time left in the game, there was no doubt that Australia would respond, and they did after five minutes. A penalty corner opportunity was duly converted by another world class dragflicker by the name of Hayward.\nWhile Australia upped their intensity after the goal, they couldn't force mistakes from India's defence. At the same time, India's counter-attacking game had bite to it, with Mandeep and Raj Kumar Pal going close with a couple of solid attempts.\nUp until that point, the game was a close one, even though Australia had more possession.\nGoing into the final quarter, India knew that Australia would come hard. This was where Fulton had to perhaps try something different. A different gameplan, which could have been a surprise for their opponents.\nThis Indian team has the ability to play the chaos game and cause all sorts of problems. It may not work for the whole match, especially against the Aussies, but it could work in bits and pieces. Maybe India could've started the final quarter strongly with the ball, trying to be more physical and high pressing. Instead, India sat back, allowed Australia to win more penalty corners and Hayward turned it around with a superb dragflick.\nIt was only after Welch scored the third that India became active on the ball again and created a couple of chances, including penalty corners. It was too late by then.\nWhat can India change for the final match?\nFulton wants India to play to a plan, and it seems like doesn't want to tinker it even after four losses. There is nothing wrong with it, it's his team and his vision. But sometimes, a slight change could add bit of a chaos and prove to be beneficial. However, it's easier said than done. It's difficult to make those mid-game drastic changes, and especially against an in-form team known for their highly attacking hockey.\n��Glimpses from a hard fought battle on the hockey field, though we lost, our spirit remains undaunted.\nOn to the next challenge with even more determination! ����#HockeyIndia #IndiaKaGame #IndianMensTeam #EnRouteToParis #OlympicPrepInAus #AUSvIND\n.\n.\n.\n.\n.@CMO_Odisha... pic.twitter.com/ZfRsMCOUk5\n- Hockey India (@TheHockeyIndia) April 12, 2024\nWith one more match left to play on Saturday, Fulton might want to give more gametime to Suraj Karkera, who pulled off as many as four saves in the third quarter to keep India in the game. The last one was a brilliant one-handed save against a half-volley which was looked like it would definitely find the net.\nConsidering Australia's terrific form, it's likely that they will finish the series with a win on Saturday. If India somehow managed to spoil it, it will be a small positive on what has been a difficult tour in preparations for the Paris Olympics.\nThe last match of the series will be on Saturday at 2 PM IST"
    }
]